'''
Напишите программу, в которой пользователь будет задавать две строки, 
а программа - определять количество вхождений одной строки в другой.
'''
line1 = input("Enter the first line1= ")
line2 = input("Enter the second line2= ")

print(line1.count(line2))